export const defaultLang = "ru";

export const ui = {
	ua: {
		// Meta
		"meta.title-home": "Привіт, я Настя психотерапевтка!",
		"meta.description-home": "Автор подкасту 'Про Башку', працюю в напрямках УIКПТ і РЕПТ.",
		"meta.title-services": "Мої послуги",
		"meta.description-services": "Допомагаю впоратися практично з будь-якою тривогою за кілька зустрічей:)",
		"meta.title-therapy": "Я терапевтую",
		"meta.description-therapy": "Допомагаю впоратися практично з будь-якою тривогою за кілька зустрічей:)",
		"meta.title-articles": "Мій подкаст",
		"meta.description-articles":
			"Послухайте подкаст і самостійно розберіться в купі питань, але похід до психолога він не замінить.",
		"meta.title-quizzes": "Тести",
		"meta.description-quizzes": "Тести які найкраще допомагають зрозуміти своє самопочуття",
		"meta.title-quiz1": "Тест на робоче вигоряння",
		"meta.description-quiz1": "Дізнайтеся наскільки ви втомилися як професіонал.",
		"meta.title-quiz2": "Тест на наявність пасток",
		"meta.description-quiz2":
			"Тест допоможе вам визначити, які пастки найсильніше проявляються у вашому житті",
		"meta.title-quiz3": "Тест на трудоголізм",
		"meta.description-quiz3": "Дізнайтеся наскільки ви трудоголік",
		"meta.title-workshops": "Мої семінари",
		"meta.description-workshops":
			"Семінари з основних переживань у житті, які можуть замінити нескінченні походи до психологів.",
		"meta.title-quiz_results": "Результати тесту",
		"meta.description-quiz_results":
			"Результати тесту не є діагнозом, а радше підсвічують нинішній стан справ.",
		"meta.title-workbook": "Воркбук «Про Башку»",
		"meta.description-workbook":
			"Файл/помічник/гайд/чек аркуш/молитва тощо, який допомагає самостійно вміти формувати чітко запити/цілі/мрії/бажання.",
		"meta.title-subbotnik": "Курс «Для Башки»",
		"meta.description-subbotnik": "Будемо розбиратися з усіма життєвими проблемами.",

		// Main layout
		socialLink1: "Мої семінари",
		socialLink2: "Мій інстаграм",
		socialLink3: "Інстаграм Про Башку",
		socialLink4: "Телеграм канал",

		"banner.title": "Курс доступний до продажу, біжи купуй!",
		"banner.btn": "До курсу",

		// Home
		"home.title": "Усім привіт, я Настя! 👋",
		"home.description1":
			"Психотерапевт у напрямках УIКПТ/РЕПТ. Веду подкаст «Про Башку». Допомагаю людям жити спокійне, щасливе життя!",
		"home.subDescription1":
			"Терапевтую як хлопчиків, так і дівчаток, понад 150 клієнтів, які пройшли через мене, стали жити краще, перестали тужити, забули про тривогу! Але найпрекрасніше для мене і для вас, що ми не сидимо в терапії роками!",
		"home.subDescription2": "Нікому не раджу!",
		"home.subDescription3":
			"У середньому ми витрачаємо від 1 до 5 зустрічей, щоб вирішити практично будь-яке нагальне питання!",
		"home.subDescription4": "Тож не бійтеся терапії🙂",
		"home.subDescription5": "Я веду як індивідуальні консультації, так і групові!",
		"home.btn": "Записатися на терапію",
		"home.subTitle1": "Чим я можу тобі допомогти?",
		"home.saleTitle": "4 семінари + Воркбук «Про башку»",
		"home.saleMore": "Детальніше",
		"home.subTitle2": "Детальніше про мене",
		"home.swiperName0": "Особиста терапія",
		"home.swiperName1": "Воркбук",
		"home.swiperName2": "Семінари",
		"home.swiperName3": "Курс",
		"home.tag": "🎓 Моя освіта",
		"home.li1": "“Соціальна психологія”",
		"home.li2": "УIКПТ+ базові техніки УIКПТ для консультування та коучингу”",

		// Services
		"services.mainTitle": "Мої послуги",
		"services.title1": "Особиста терапія",
		"services.title2": "Воркбук",
		"services.title3": "Семінари",
		"services.title4": "Курс",
		"services.description1":
			"Терапевтую як хлопчиків, так і дівчаток, понад 150 клієнтів, які пройшли через мене, стали жити краще, перестали тужити, забули про тривогу! Але найпрекрасніше для мене і для вас, що ми не сидимо в терапії роками!",
		"services.description2":
			"З ним вийде зрозуміти, чого мені зараз бракує в житті, сформувати поступовий план з досягнення цілей і реалізувати все заплановане, без зривів і перегинів.",
		"services.description3":
			"Розкриваю більш детально такі теми як «Самооцінка», «Травми», «Стосунки» і «Кар'єра».",
		"services.description4": "Протягом місяця (8 зустрічей) будемо розбиратися з усіма життєвими проблемами.",
		"services.btn": "Відкрити",

		// Therapy
		"therapy.title": "З чим я можу допомогти?",
		"therapy.description": "Насправді практично з усім :)",
		"therapy.li1": "Відсутність сенсу життя",
		"therapy.li2": "Прокрастинація",
		"therapy.li3": "Страх зміни роботи",
		"therapy.li4": "Агресивна поведінка",
		"therapy.li5": "Що про мене подумають інші",
		"therapy.li6": "Постійна тривога",
		"therapy.li7": "Боязнь осуду",
		"therapy.li8": "ОКР на нервовому ґрунті",
		"therapy.li9": "Панічні атаки",
		"therapy.li10": "Складні стосунки з їжею",
		"therapy.li11": "Проблеми в любовних/сексуальних стосунках",
		"therapy.li12": "Стосунки з батьками",
		"therapy.li13": "Депресія",
		"therapy.li14": "Синдром самозванця",
		"therapy.li15": "Суїцидальні думки",
		"therapy.subTitle1": "від 1 до 5 сесій",
		"therapy.subDescription1":
			"Це середня кількість зустрічей, після яких ви отримуєте потрібні інструменти для самостійного регулювання будь-яких життєвих ситуацій.",
		"therapy.subDescriptionPrice": "Вартість сесії 70 €",
		"therapy.subDescriptionPriceSpan": "(за курсом НБУ)",
		"therapy.subTitle2": "60 хвилин",
		"therapy.subDescription2":
			"Триває сесія, але якщо ви не встигли закінчити думку, на півслові я вас переривати не буду.",
		"therapy.btn": "Записатися на терапію",
		"therapy.info": "Також я веду групові зустрічі, які не менш ефективні та більш доступні за грошима.",
		"therapy.infoLink": "Ознайомитися можна тут",
		"therapy.subTitle3": "Відгуки клієнтів",
		"therapy.slide1":
			"Завдяки Насті я дійсно почала спокійно жити і реально стала джекі чаном як і було обіцяно!!! Запитів було багато і я думала, що це затягнеться на роки, але я навіть не встигла моргнути, як за кілька наших з нею розмов у мене пропали всі мої думки, які дуже довго великим вантажем сиділи в моїй голові! Дихати стало легше і жити ще краще! Настянчик топ і БІГІТЄЄЕЕ ШВИДКО НА КОНСУЛЬТАЦІЮ І КУПУЙТЕ ВОРКБУК АЛЛООООООООО!!!",
		"therapy.name1": "Мар'яна",
		"therapy.slide2":
			"До тебе: 6 місяців терапії, де ми по колу обговорювали тата з мамою і жаліли мене. 0 вирішених проблем. Образа на матір. Жалість до себе. Після 9 сесій з тобою: Зрозуміла, як знімати тривожність і заспокоювати себе. Як не думати, що я помру бомжем 😂 як не карати себе. Як не гнобити себе і не звинувачувати у всіх невдачах. Почала проводити час без чоловіка і друзів і не відчувати себе самотньо. Стала більш щасливою.",
		"therapy.name2": "Еліна",
		"therapy.slide3":
			"Просто після розмови з тобою, мій настрій підскакує різко вгору, посмішка не сходить з лиця і з'являється стільки енергії 🤩 що хочеться знімати рілсікі або танцювати, а може і все разом, чим я і зайнялася 😂 Перед розмовою, мільйон незрозумілих думок, тривожність, через годину, все розкладено по поличках і моїй голові ясність!!! А тривожності як і не було! Спасибі тобі велике 🙏🏻",
		"therapy.name3": "Оля",
		"therapy.slide4":
			"Привіт, Настя. Хочу сказати, що після нашої сесії я прийшла в адекватність😁 у комунікації відчуваю, що менше впадаю в дитину, читаю книжки, які ти рекомендувала, розумію, чому я поводжуся так як поводжуся, виводжу це в усвідомлений стан, простіше справлятися з емоціями, коли згадую, що емоція триває 90 сек. Дякую тобі, це з усіх моїх сесій за 4 роки терапії найрезультативніша.",
		"therapy.name4": "Ліка",
		"therapy.slide5":
			"Настюшка, дуже допомогла мені. Я перестала пити по пляшці вина щодня, я зрозуміла, що це просто звичка, а не так званий алкоголізм. Перестала заїдати й запивати свої проблеми. Ходжу в зал уже рік, схудла на 11 кг. Хоча коли ми починали терапію, ненавиділа спортзал. Я стала набагато впевненішою в собі. Навчилася цінувати себе ще більше. Перестала жити з підсадженими мені думками моїх батьків. Навчилася не заганятися заздалегідь від того, чого ще не сталося.  Коротше життя налагодилося 100%. Найкращий психолог, однозначно ❤️❤️❤️",
		"therapy.name5": "Ліза",
		"therapy.slide6":
			"Дарова. Пише РусичеГ. Щодо нашої роботи скажу: все було чітко! Конкретно, швидко і безболісно! Прийшов зі своїм запитом! Отримав інструменти для роботи над моїми моментиками! Заебись крч. Однозначно рекомендосьен! Якщо ще раз потраплю в просак, обов'язково звернуся. Бро!",
		"therapy.name6": "Русик",
		"therapy.slide7":
			"Настя, привіт 👋 Хочу сказати тобі велике спасибі, за нашу виконану роботу, не знаю, як це працює в тебе, але це працює, стільки ситуацій, які вирішувалися самі по собі після наших занять, що іноді саму це дивувало, як так може бути, ти крута й дуже розумна, ще раз спасибі 🙏🏻 За моє прийняття себе, любов і віру в себе, це все завдяки тобі ☺️",
		"therapy.name7": "Надія",
		"therapy.slide8":
			"Привіт Хочу залишити відгук про прекрасну фахівчиню, майстриню слова і розпізнання проблем або донесення розуміння чому проблеми немає. Умілиці складні ситуації розкласти на прості. Швидкої допомоги (мені вистачило пари сесій). А потім тільки лише хотілося іноді поговорити з розумною людиною. Якщо тобі складно, а хочеться просто і ти готова працювати над собою, зі своєю «башкою». То моя рекомендація звернутися до Насте❤️",
		"therapy.name8": "Яна",
		"therapy.slide9":
			"Мені порадила тебе Любка, я прийшла подивилася на твою інсту і подумала, що ти дуже ржачна чітка смішна рівна подруга, але як психолог, напевно, не тому, що ми будемо гігі гага і отето все. Потім я переслухала всі твої подкасти і кожен раз в сердечко - і про депресію емігранта, і кровосток))))))) думаю - ну не треба йти, а тепер у мене не болить живіт чомусь і швидку не викликали давно, робота знайшлася і собачка майже не ригає",
		"therapy.name9": "Лера та Арнюшка",
		"therapy.slide10":
			"Моя співпраця почалася з тобою, коли я усвідомила, що попередній психолог 1,8 років просто показує мені мої емоціі і травми минулого та абсолютно незацікавлена показати як з цим жити в теперішньому. Я просто хочу сказати тобі, що раніше в голові завжди була думка: « А як же без психолога? Коли я зможу самостійно керувати життям і приймати усвідомленні рішення?скільки років ще має минути?». Завдяки нашій роботі я навчилася довіряти собі, бачити себе справжньою, почала чути той внутрішній голос не палача, а голос який співчуває, підтримує мене, каже що помилятися це нормально… що я можу сама собі дозволяти все, що я хочу…І я знаю, що помилки ще будуть, але вори мої.. я знаю, що будуть інколи сумніви, але я справлюся, я знаю що мені непотрібен « хтось», щоб бути щасливою, коханою, почутою, я знаю що це все я можу дати собі сама. Я стільки років жила в страху, що хто думає, що буде в майбутньому, а якщо все вийде нетак як я планую… А тепер моє головне правило, йти на зустріч страху і подивитися що буде? А буде вихід із зони комфортна, розвиток, самореалізація і усвідомлення своєї неймовірної сили всередині себе.. Дякую тобі за мене..🫵❤️",
		"therapy.name10": "Наталі",
		"therapy.slide11":
			"Дуже рада, що звернулася саме до вас 😌Ви дуже добрий і кваліфікований фахівець ❤️все чітко і по ділу ✍️уверенна що саме з вами я досягну бажаної мети 🎯було лише кілька зідзвонів, але в голові вже дуже багато чого змінилося 💝",
		"therapy.name11": "Ксенія",
		"therapy.slide12":
			"До Насті я звернувся, коли психічний стан почав заважати відчувати себе повноцінним і спроможним бути щасливим. Багато годин я провів, слухаючи подкаст Про Башку і, коли сформував свій власний запит - вирішив написати Насті особисто. Після декількох сеансів мій стан був схожий на перші хвилини пробудження. Протираючи заспані очі, я бачу яскраве тепле світло, до якого ще мушу звикнути. І головне, що це світло я бачу у відображенні. Дякую Насті за її роботу!",
		"therapy.name12": "Артем",

		// Articles
		"articles.title": "Випуски подкасту",
		"articles.label": "Пошук за подкастами",
		"articles.search": "Пошук",
		"card.listen1": "Послухати",
		"card.listen2": "Читати",

		// Article
		"article.back": "До всіх випусків",
		"article.listen": "Слухати",
		"article.prev": "Попередня стаття",
		"article.next": "Наступна стаття",
		"article.other": "Інші подкасти",
		"article.listenIn": "Послухати в",
		"article.close": "Закрити",

		// Quizzes
		"quizzes.mainTitle": "Психологічні тести",
		"quizzes.title1": "Тест “Вигоряння на робочому місці” (CBI)",
		"quizzes.description1":
			'Короткий тест на 19 запитань, який покаже, на якій стадії вигоряння ви зараз "імовірно" перебуваєте.',
		"quizzes.subDescription": "*тест не є діагнозом, а скоріше підказкою до дії",
		"quizzes.link": "Пройти тест",
		"quizzes.title2": "Тест “На наявність дитячих травм”",
		"quizzes.description2": "Тест, який допоможе визначити, які дитячі травми заважають у дорослому житті.",
		"quizzes.title3": "Тест “Наявність Трудоголізму”",
		"quizzes.description3":
			"Тест на трудоголізм, який зможе показати відмінність здорового ентузіазму до роботи та ідеалістичної вимоги до себе як співробітника.",

		// Quiz
		"quiz.back": "Назад",
		"quiz.next": "Далі",
		"quiz.label1": "У дитинстві",
		"quiz.label2": "Зараз",
		"quiz.option": "Виберіть відповідь",
		"quiz.skip": "Пропустити",
		"quiz.submit": "Зберегти результат",
		"quiz.save": "Зберегти результат в особистому кабінеті?",
		"quiz.inputPlaceholder": "Введіть e-mail",
		"quiz.results": "Результати тесту",
		"quiz.description":
			"Що вищий бал у пастки ви отримали, то, ймовірно, сильніше вона впливає на ваше життя. Ви можете прочитати більше про кожну з важливих для вас пасток нижче.",
		"quiz.about1": "Імовірніше у вас є схильність до пасток",
		"quiz.about2": "У вас немає пастки",
		"quiz.resultHeader": "Результати тесту",
		"quiz.errorResultHeader": "Не вдалося знайти результат для цього ідентифікатора",
		"quiz.userState": "Оцінка стану за балами",
		"quiz.statePosition": "👈 Ви тут",
		"quiz.therapyBtn": "Записатися на терапію",
		"quiz.resultShare": "Ти можеш поділитися своїм результатом зі мною, наприклад у Telegram",
		"quiz.resultLink": "Поділитися результатом",
		"quiz.copy": "Посилання скопійовано",
		"quiz.copyError": "Не працює буфер обміну",
		"quiz.copyTitle": "Результати тестування",
		"quiz.error1": "Будь ласка, дайте відповідь на всі питання, перш ніж отримати результат.",
		"quiz.error2": "Не вдалося надіслати тест. Спробуйте пізніше.",

		// Quiz1
		"quiz1.title": "Вигоряння",

		// Quiz2
		"quiz2.title": "Дитячі травми",

		// Quiz3
		"quiz3.title": "Трудоголізм",
		"quiz3.description1":
			"Трудоголізм є такою ж формою саморуйнування, як і інші залежності. Він призводить до перевтоми, браку сил на інші заняття та звуження кола інтересів. Усе витісняє необхідність почуватися дуже потрібним, незамінним у певних справах. Трудоголікам ніколи й нецікаво користуватися результатами своєї праці, вони постійно жертвують власними потребами. Багато з них щасливі, коли про них кажуть, що вони «горять на роботі», і заздрять тим, кому вдалося померти на трудовому посту.",
		"quiz3.description2":
			"До трудоголізму більш схильні старші або єдині діти в сім'ї, де батько - алкоголік, а мати - співзалежна. Дитина виконує безліч домашніх обов'язків, намагається добре вчитися, щоб компенсувати ганьбу сім'ї, посилено готується до престижного вишу або домагається спортивних перемог. Вона позбавляє себе відпочинку і розваг, стає антиподом батькові. Але це тільки зовні, основа у трудоголізму й алкоголізму спільна: втеча в залежність, саморуйнування.",

		// Workshops
		"workshops.title": "Мої семінари",
		"workshops.tooltip": "Хто веде семінари",
		"workshops.tooltipName1": "Настя",
		"workshops.tooltipAbout1": "уікпт/репт психотерапевтка та коуч",
		"workshops.tooltipName2": "Лера Суєта",
		"workshops.tooltipAbout2": "донецька бомжиха",
		"workshops.description1":
			"Я вже провела чотири семінари, записи яких можна купити окремо. Також можна купити всі записи одним пакетом за 2000 ₴",
		"workshops.descriptionSpan1": "ось тут",
		"workshops.description2.1": "Також у мене є",
		"workshops.descriptionLink": "Воркбук «Про Башку»",
		"workshops.description2.2":
			"який допомагає самостійно вміти формувати чітко запити/цілі/мрії/бажання. Його ти можеш придбати з 50% знижкою, якщо купуєш Пакет «4 семінари»",

		"workshopCard.tag1": "проведений:",
		"workshopCard.tag2": "буде:",
		"workshopCard.date": "дата",
		"workshopCard.start": "старт",
		"workshopCard.startText": "по Києву",
		"workshopCard.time": "таймінг",
		"workshopCard.timeText": "години",
		"workshopCard.price": "ціна",
		"workshopCard.buy1": "Купити запис",
		"workshopCard.buy2": "Купити",

		"allWorkshops.tag": "Економія",
		"allWorkshops.title": "Пакет “4 семінари”",
		"allWorkshops.text": "/ пакет",
		"allWorkshops.description": "До пакета входить:",
		"allWorkshops.price1": "за",
		"allWorkshops.price2": "можна купити пакет",
		"allWorkshops.btn": "Купити",

		// Workbook
		"workbook.title": "Воркбук «Про Башку»",
		"workbook.subTitle1": "Кому потрібен воркбук?",
		"workbook.li1": "Усім тривожним пиріжечкам, які:",
		"workbook.subLi1": "Не знают, за что хвататься в жизни",
		"workbook.subLi2": "Не розуміють, що їх чекає далі",
		"workbook.subLi3": "Не вміють себе любити і постійно тривожаться",
		"workbook.li2": "Усім, хто хоче поліпшити своє фінансове становище, але:",
		"workbook.subLi4": "Не вірять, що зможуть",
		"workbook.subLi5": "Упевнені, що нікому не потрібні і помруть бомжами",
		"workbook.subLi6": "Думають, що гроші тільки у мажорів, а їм не судилося заробляти",
		"workbook.li3": "Усім, хто хоче прекрасних стосунків, але:",
		"workbook.subLi7": "Давно самотні і нібито відлякують нормальних чоловіків або з вінцем безшлюбності",
		"workbook.subLi8": "З «тривожним типом прив'язаності»",
		"workbook.subLi9": "Бояться чоловіків/жінок, бо хороших усіх розібрали",
		"workbook.li4": "Заплуталися в житті та:",
		"workbook.subLi10": "Вас ніхто не розуміє, немає ніякої підтримки",
		"workbook.subLi11": "Немає сил нічого робити",
		"workbook.subLi12": "Не знають як далі жити",
		"workbook.description": "Коротше, воркбук для всіх!",
		"workbook.btnText": "Воркбук «Про Башку»",
		"workbook.btnClick": "Купити",
		"workbook.cardTitle1": "Воркбук «Про башку»",
		"workbook.cardText1": "PDF-файл воркбука",
		"workbook.cardText2": "Пакет «4 семінару» (Самооцінка, Травми, Стосунки, Кар'єра, Відносини)",
		"workbook.cardTitle2": "4 семінару + Воркбук «Про башку»",
		"workbook.subDescription": "Купуючи пакет «4 семінари» - забирай воркбук із",
		"workbook.subDescriptionSpan1": "знижкою 50%,",
		"workbook.detailTitle1": "Чим корисний воркбук?",
		"workbook.detailText1":
			"Він допомагає дивитися на всі свої сфери життя усвідомлено, без страху, не уникаючи гострих кутів. З ним вдасться зрозуміти, чого мені зараз не вистачає в житті, сформувати поступовий план з досягнення цілей і реалізувати все заплановане, без зривів і перегинів.",
		"workbook.detailTitle2": "Що я отримаю за підсумком?",
		"workbook.detailText2":
			"95% користувачів воркбука відзначили, що після роботи з ним знижується рівень фонової тривоги незрозуміло від чого, все стає на свої місця, перестають формуватися незрозумілі страхи, розвивається навичка глибшого розуміння себе і своїх цінностей, потреб, бажань. За підсумком, життя стає кращим, більш підконтрольним, осмисленим і щасливим.",
		"workbook.detailTitle3": "Як ним користуватися?",
		"workbook.li5":
			"Роздруковуємо воркбук, це обов'язкове і найважливіше в роботі з ним. Коли ми пишемо рукою, що ми думаємо, хочемо, мріємо, ми перебуваємо саме в цьому моменті максимально усвідомлено. Писати ручкою в нинішній час особливий вид терапії.",
		"workbook.li6":
			"Відповідаємо максимально відверто на всі запитання, пишемо стільки, скільки спадає на думку відповідей, що більше, то краще. Якщо на якісь запитання не виходить відразу відповісти з голови, дивіться приклад заповненого воркбука.",
		"workbook.li7": "Формуємо цілі, плани, мрії, які нам зараз так потрібні.",
		"workbook.li8": "Складаємо план із дрібних впроваджень, кроків, змін на шляху до своєї мети.",
		"workbook.li9":
			"Починаємо впроваджувати все перераховане вище в життя і відзначаємо успіхи та зміни по ходу справи.",
		"workbook.detailText3":
			"У воркбуці ви знайдете qr на додаткові матеріали, які зможуть вам допомогти в його заповненні. Не відкладайте ваше благополуччя в довгу шухляду, життя одне, пережити його не вийде. Всіх благ! ✨",
		"workbook.subTitle3": "Блогери, які обрали воркбук",
		"workbook.blogerText": "Стати моїм партнером",
		"workbook.blogerTextSpan": "Зв'язатися",

		// Subbotnik
		"subbotnik.title": "Курс «Для Башки»",
		"subbotnik.subTitle1": "Що ви отримуєте?",
		"subbotnik.subTitle2": "Що ми будемо розбирати?",
		"subbotnik.description1": "Протягом місяця (8 зустрічей) будемо розбиратися з усіма життєвими проблемами",
		"subbotnik.description2": "Зустрічі відбуватимуться у вихідні (~2 години часу закладайте)",
		"subbotnik.description3": "У дз входить література + техніки + воркбук + статті",
		"subbotnik.description4":
			"У нас буде група, де всі завжди зможуть ставити запитання, ділитися інфою, переживаннями і що завгодно, зі мною на зв'язку весь час поки я не сплю)))",
		"subbotnik.description5":
			"Про всяк випадок скажу, хто нічого не робить, у того нічого і не змінюється :)",
		"subbotnik.name1": "Неділя",
		"subbotnik.name2": "Субота",
		"subbotnik.about1": "основна лекція за темою +",
		"subbotnik.about2": "питання + дз",
		"subbotnik.about3": "перевіряємо дз + розбираємо що",
		"subbotnik.about4": "незрозуміло + базікаємо",
		"subbotnik.info": "УСІМ УЧАСНИКАМ ВОРКБУК У ПІДАРУНОК!",
		"subbotnik.li1":
			"Розуміння як бути норм Джекі Чаном і як жити весело, і щасливо без тривоги і нескінченних страждань",
		"subbotnik.li2": "Економія грошиків (8 сесій зі мною коштують 25 600 ₴)",
		"subbotnik.li3": "Інструменти які служитимуть вам усе життя",
		"subbotnik.li4": "Підтримуюче ком'юніті",
		"subbotnik.li5": "Воркбук",
		"subbotnik.li6": "Книги",

		"subbotnikTopic.title1": "Дитинство",
		"subbotnikTopic.title2": "Самооцінка",
		"subbotnikTopic.title3": "Кар'єра",
		"subbotnikTopic.title4": "Стосунки",
		"subbotnikTopic.li1": "Травми",
		"subbotnikTopic.li2": "Когнітивні помилки",
		"subbotnikTopic.li3": "Здорова сепарація",
		"subbotnikTopic.li4": "Наслідки",
		"subbotnikTopic.li5": "Як перестати себе задрачувати (селфхарм, рпп та інші прЕколи)",
		"subbotnikTopic.li6": "Як зрозуміти «хто я»",
		"subbotnikTopic.li7": "Як знайти в собі сили",
		"subbotnikTopic.li8": "Як себе любити",
		"subbotnikTopic.li9": "Як заробляти бабки",
		"subbotnikTopic.li10": "Як заробляти і щоб масик сипав монетку",
		"subbotnikTopic.li11": "Як не боятися проявлятися",
		"subbotnikTopic.li12": "Як знайти себе",
		"subbotnikTopic.li13": "Секс (ой тут я можу роки розповідати)",
		"subbotnikTopic.li14": "Партнерські відносини",
		"subbotnikTopic.li15": "Хто що кому винен",
		"subbotnikTopic.li16": "Ревнощі",

		"subbotnikCard.title": "Курс “Для Башки”",
		"subbotnikCard.description": "Проводиться невеликою групою кожні вихідні",
		"subbotnikCard.detail1": "старт",
		"subbotnikCard.detail2": "таймінг",
		"subbotnikCard.detail3": "години",
		"subbotnikCard.detail4": "час",
		"subbotnikCard.detail5": "окончание",
		"subbotnikCard.detail6": "(по Киеву)",
		"subbotnikCard.btn": "Купити за 4 999 ₴",

		// WorkshopModal
		"workshopModal.title": "Форма оплати",
		"workshopModal.email": "Введіть пошту, на яку прийде доступ",
		"workshopModal.oneWorkshopTitle": "Семінар",
		"workshopModal.allWorkshop": "Вигідний пакет «4 семінари»",
		"workshopModal.allWorkshopTitle": "Пакет «4 семінари» + воркбук (знижка 50%)",
		"workshopModal.workbook": "Докупи воркбук зі знижкою",
		"workshopModal.workbookDescription": "+ Ворбук «Про Башку» (знижка 50%)",
		"workshopModal.promoPlaceholder": "Введіть промокод",
		"workshopModal.applyPromoCode": "Застосувати",
		"workshopModal.promoError": "Неправильний промокод",
		"workshopModal.result": "До сплати",
		"workshopModal.btn": "Оплатити",

		// Thank you
		"thankYou.title": "Юху, оплата пройшла успішно :)",
		"thankYou.titleError1": "Дані про замовлення не знайдено",
		"thankYou.titleError2": "Помилка під час оплати",
		"thankYou.description": "На жаль, оплата не пройшла :(",
		"thankYou.email": "Лист надіслано на пошту",
		"thankYou.link": "Перейти в особистий кабінет",
		"thankYou.bundle": "Пакет «4 семінари»",
		"thankYou.seminarOld": "Подивитися запис можна в особистому кабінеті",
		"thankYou.seminarNew": "Посилання на Zoom прийде на пошту в день семінару",
		"thankYou.seminarsOld": "Подивитися записи можна в особистому кабінеті",
		"thankYou.workBook": "Завантажити воркбук можна в особистому кабінеті",
		"thankYou.groupTherapy": "Посилання на Telegram-канал прийде на пошту",

		// Dashboard
		"dashboard.name": "Особистий кабінет",
		"dashboard.logout": "Вийти",
		"dashboard.tab1": "Покупки",
		"dashboard.tab2": "Курс",
		"dashboard.tab3": "Тести",
		"dashboard.title1": "Актуальні пропозиції",
		"dashboard.title2": "Воркбук «Про Башку»",
		"dashboard.title3": "Куплені семінари",
		"dashboard.title4": "Результати тестів",
		"dashboard.title5": "Курс «Для Башки»",
		"dashboard.description1": "У вас є такі пастки:",
		"dashboard.description2": "Ваша оцінка стану за балами",
		"dashboard.description3": "У вас немає пасток",
		"dashboard.link": "Подивитися повністю",
		"dashboard.navigation": "Показані",
		"dashboard.option1": "Українська",
		"dashboard.option2": "Російська",
		"dashboard.open": "Відкрити відео",
		"dashboard.time": "буде",
		"dashboard.week": "-а неділя",

		"dashboardLogin.title": "Увійти в особистий кабінет",
		"dashboardLogin.help": "Ми надіслали код на пошту",
		"dashboardLogin.email": "Введіть свій e-mail",
		"dashboardLogin.otp": "Введіть код",
		"dashboardLogin.next": "Далі",
		"dashboardLogin.login": "Увійти",
		"dashboardLogin.back": "Назад",
		"dashboardLogin.or": "або",
		"dashboardLogin.google": "Увійти за допомогою Google",

		"dashboardWorkbook.titel": "Завантажити воркбук",
		"dashboardWorkbook.text1": "порожній",
		"dashboardWorkbook.text2": "заповнений",

		"dashboardEmpty.title1": "Упс, ви поки що нічого не купили :(",
		"dashboardEmpty.title2": "Упс, ви ще не проходили тестів :(",
		"dashboardEmpty.description1":
			"Зараз у вас нічого не куплено, але це можна виправити, купивши будь-який із доступних продуктів:",
		"dashboardEmpty.description2":
			"Ви можете пройти тести і зберегти свої результати тут, щоб надалі працювати з цими результатами",
		"dashboardEmpty.link1": "Семінари",
		"dashboardEmpty.link2": "Воркбук",
		"dashboardEmpty.link3": "Суботник",
		"dashboardEmpty.link4": "Пройти тести",

		// 404
		"404.title": "Ой! Сторінку не знайдено.",
		"404.text": "На жаль, ми не змогли знайти сторінку, яку ви шукали.",
		"404.link": "Повернутися на головну сторінку",

		// Errors
		"errors.sendData": "Помилка під час надсилання даних",
		"errors.sendGoogleData": "Помилка під час авторизації через Google",
		"errors.sendEmailData": "Помилка під час надсилання e-mail",
		"errors.sendOtpData": "Помилка під час надсилання otp",
	},
	ru: {
		// Meta
		"meta.title-home": "Привет, я Настя психотерапевтка!",
		"meta.description-home": "Автор подкаста “Про Башку”, работаю в направлениях КПТ и РЭПТ.",

		"meta.title-services": "Мои услуги",
		"meta.description-services": "Помогаю справиться практически с любой тревогой за несколько встречь:)",

		"meta.title-therapy": "Я терапевтирую",
		"meta.description-therapy": "Помогаю справиться практически с любой тревогой за несколько встречь:)",

		"meta.title-quizzes": "Тесты",
		"meta.description-quizzes": "Тесты которые лучше помогают понять свое самочувствие",

		"meta.title-quiz1": "Тест на рабочее выгорание",
		"meta.description-quiz1": "Узнайте насколько вы устали как профессионал.",

		"meta.title-quiz2": "Тест на наличие ловушек",
		"meta.description-quiz2":
			"Тест поможет вам определить, какие ловушки сильнее всего проявляются в вашей жизни.",

		"meta.title-quiz3": "Тест на трудоголизм",
		"meta.description-quiz3": "Узнайте насколько вы трудоголик",

		"meta.title-workshops": "Мои семинары",
		"meta.description-workshops":
			"Семинары по основным переживаниям в жизни, которые могут заменить бесконечные походы к психологам.",

		"meta.title-quiz_results": "Результаты теста",
		"meta.description-quiz_results":
			"Результаты теста не являются диагнозом, а скорее подсвечивают нынешнее положение дел.",

		"meta.title-workbook": "Воркбук «Про Башку»",
		"meta.description-workbook":
			"Файл/помощник/гайд/чек лист/молитва и тд, который помогает самостоятельно уметь формировать четко запросы/цели/мечты/пожелания.",

		"meta.title-subbotnik": "Курс «Для Башки»",
		"meta.description-subbotnik": "Будем разбираться со всеми жизненными проблемами.",

		// Main layout
		socialLink1: "Мои семинары",
		socialLink2: "Мой инстаграм",
		socialLink3: "Инстаграм Про Башку",
		socialLink4: "Телеграм канал",

		"banner.title": "Курс доступен к продаже, беги покупай!",
		"banner.btn": "К курсу",

		// Home
		"home.title": "Всем привет, я Настя! 👋",
		"home.description1":
			"Психотерапевт в направлениях КПТ/РЭПТ. Веду подкаст “Про Башку”. Помогаю людям жить спокойную, счастливую жизнь!",
		"home.subDescription1":
			"Терапевтирую как мальчиков так и девочек, более 150 клиентов прошедших через меня, стали жить лучше, перестали тужить, забыли о тревоге! Но самое великолепное для меня и для вас, что мы не сидим в терапии годами!",
		"home.subDescription2": "Никому не советую!",
		"home.subDescription3":
			"В среднем мы тратим от 1 до 5 встреч, чтобы решить практически любой насущный вопрос!",
		"home.subDescription4": "Так что не бойтесь терапии🙂",
		"home.subDescription5": "Я веду как индивидульные консультации, так и групповые!",
		"home.btn": "Записаться на терапию",
		"home.subTitle1": "Чем я могу тебе помочь?",
		"home.saleTitle": "4 семинара + Воркбук «Про башку»",
		"home.saleMore": "Подробнее",
		"home.subTitle2": "Подробнее обо мне",
		"home.swiperName0": "Личная терапия",
		"home.swiperName1": "Воркбук",
		"home.swiperName2": "Семинары",
		"home.swiperName3": "Курс",
		"home.tag": "🎓 Мое образование",
		"home.li1": "“Социальная психология”",
		"home.li2": "“КПТ+ базовые техники КПТ для консультирования и коучинга”",

		// Services
		"services.mainTitle": "Мои услуги",
		"services.title1": "Личная терапия",
		"services.title2": "Воркбук",
		"services.title3": "Семинары",
		"services.title4": "Курс",
		"services.description1":
			"Терапевтирую как мальчиков так и девочек, более 150 клиентов прошедших через меня, стали жить лучше, перестали тужить, забыли о тревоге! Но самое великолепное для меня и для вас, что мы не сидим в терапии годами!",
		"services.description2":
			"С ним получится понять, чего мне сейчас не хватает в жизни, сформировать постепенный план по достижению целей и реализовать все запланированное, без срывов и перегибов.",
		"services.description3":
			'Раскрываю более детально такие темы как "Самооценка", "Травмы", "Отношения" и "Карьера".',
		"services.description4": "В течении месяца (8 встреч) будем разбираться со всеми жизненными проблемами.",
		"services.btn": "Открыть",

		// Therapy
		"therapy.title": "С чем я могу помочь?",
		"therapy.description": "На самом деле практически со всем :)",
		"therapy.li1": "Отсутствие смысла жизни",
		"therapy.li2": "Прокрастинация",
		"therapy.li3": "Страх смены работы",
		"therapy.li4": "Агрессивное поведение",
		"therapy.li5": "Что обо мне подумают другие",
		"therapy.li6": "Постоянная тревога",
		"therapy.li7": "Боязнь осуждения",
		"therapy.li8": "ОКР на нервной почве",
		"therapy.li9": "Панические атаки",
		"therapy.li10": "Сложные отношения с едой",
		"therapy.li11": "Проблемы в любовных/сексуальных отношениях",
		"therapy.li12": "Отношения с родителями",
		"therapy.li13": "Депрессия",
		"therapy.li14": "Синдром самозванца",
		"therapy.li15": "Суицидальные мысли",
		"therapy.subTitle1": "от 1 до 5 сессий",
		"therapy.subDescription1":
			"Это среднее количество встреч, после которых вы приобретаете нужные инструменты для самостоятельного регулирования любых жизненных ситуаций.",
		"therapy.subDescriptionPrice": "Стоимость сессии 70 €",
		"therapy.subDescriptionPriceSpan": "(по курсу НБУ)",
		"therapy.subTitle2": "60 минут",
		"therapy.subDescription2":
			"Длится сессия, но если вы не успели закончить мысль, на полуслове я вас прерывать не буду.",
		"therapy.btn": "Записаться на терапию",
		"therapy.info":
			"Также я веду групповые встречи, которые не менее эффетивные и более доступные по деньгам.",
		"therapy.infoLink": "Ознакомиться можно здесь",
		"therapy.subTitle3": "Отзывы клиентов",
		"therapy.slide1":
			"Благодаря Насте я действительно начала спокойно жить и реально стала джеки чаном как и было обещано!!! Запросов было много и я думала что это затянется на года но я даже не успела моргнуть как за несколько наших с ней разговоров у меня пропали все мои мысли которые очень долго большим грузом сидели в моей голове! Дышать стало легче и жить еще лучше!  Настянчик топ и БЕГИТЕЕЕ СКОРО НА КОНСУЛЬТАЦИЮ И ПОКУПАЙТЕ ВОРКБУК АЛЛООООООО!!!",
		"therapy.name1": "Марьяна",
		"therapy.slide2":
			"До тебя: 6 месяцев терапии, где мы по кругу обсуждали папу с мамой и жалели меня. 0 решенных проблем. Обида на мать. Жалость к себе. После 9 сессий с тобой: Поняла, как снимать тревожность и успокаивать себя. Как не думать, что я умру бомжом 😂 как не наказывать себе. Как не гнобить себя и не винить во всех неудачах. Начала проводить время без мужа и друзей и не чувствовать себя одиноко. Стала более счастливой.",
		"therapy.name2": "Элина",
		"therapy.slide3":
			"Просто после разговора с тобой, мое настроение подскакивает резко вверх, улыбка не сходит с лица и появляется столько энергии 🤩 что хочется снимать рилсики или танцевать, а может и все вместе, чем я и занялась 😂 Перед разговором, миллион не понятных мыслей, тревожность, спустя час, все разложено по полочкам и моей голове ясность!!! А тревожности как и не было! Спасибо тебе большое 🙏🏻",
		"therapy.name3": "Оля",
		"therapy.slide4":
			"Приветики, Настя. Хочу сказать, что после нашей сессии я пришла в адекват😁 в коммуникации чувствую что меньше впадаю в ребенка, читаю книги что ты рекомендовала, понимаю почему я веду себя так как веду, вывожу это в осознанное состояние, проще справляться с эмоциями когда вспоминаю что эмоция длится 90 сек. Благодарю тебя, это из всех моих сессией за 4 года терапии самая результативная.",
		"therapy.name4": "Лика",
		"therapy.slide5":
			"Настюшка, очень помогла мне. Я перестала пить по бутылке вина каждый день, я поняла что это просто привычка, а не так званный алкоголизм. Перестала заедать и запивать свои проблемы. Хожу в зал уже год, похудела на 11 кг. Хотя когда мы начинали терапию, ненавидела спорт зал. Я стала гораздо увереннее в себе. Научилась ценить себя еще больше. Перестала жить с подсаженными мне мыслями, моих родителей. Научилась не загоняться заранее от того, чего еще не произошло. Короче жизнь наладилась 100%. Лучший психолог, однозначно ❤️❤️❤️",
		"therapy.name5": "Лиза",
		"therapy.slide6":
			"Дарова. Пишет РусичеГ. По нашей работе скажу все было четко! Конкретно, быстро и безболезненно! Пришел со своим запросом! Получил инструменты для работы над моими моментиками! Заебись крч. Однозначно рекомендосьен! Если еще раз попаду в просак, обязательно обращусь. Бро!",
		"therapy.name6": "Русик",
		"therapy.slide7":
			"Настя, привет 👋 Хочу сказать тебе большое спасибо, за нашу проделанную работу, не знаю как это работает у тебя но это работает, столько ситуаций которые решались сами по себе после наших занятий , что иногда саму это удивляло как так может быть, ты крутая и очень умная , еще раз спасибо 🙏🏻 За мое принятие себя, любовь и веру в себя, это все благодаря тебе ☺️",
		"therapy.name7": "Надежда",
		"therapy.slide8":
			"Приветик! Хочу оставить отзыв о прекрасной специалистке ,мастерице слова и распознания проблем или донесения понимания почему проблемы нет. Умелице сложные ситуации разложить на простые. Быстрой помощи (мне хватило пары сессий). А потом только лишь хотелось иногда поговорить с умным человеком. Если тебе сложно, а хочется просто и ты готова работать над собой, со своей «башкой». То моя рекомендация обратиться к Насте❤️",
		"therapy.name8": "Яна",
		"therapy.slide9":
			"Мне посоветовала тебя Любка, я пришла посмотерла на твою инсту и подумала, что ты очень ржачная четкая смешная ровная подруга, но как психолог наверное не потому что мы будем гиги гага и отето все. потом я переслушала все твои подкасты и каждый раз в сердечко - и про депрессию эмигранта, и кровосток))))))) думаю - ну не нада идти, А ТЕПЕРЬ У МЕНЯ НЕ БОЛИТ ЖИВОТ ПОЧЕМУ-ТО И СКОРУЮ НЕ ВЫЗЫВАЛИ ДАВНО, РАБОТА НАШЛАСЬ И СОБАЧКА ПОЧТИ НЕ РЫГАЕТ",
		"therapy.name9": "Лера и Арнюшка",
		"therapy.slide10":
			"Мое сотрудничество началось с тобой, когда я осознала, что предыдущий психолог 1,8 лет просто показывает мне мои эмоции и травмы прошлого и абсолютно незаинтересована показать как с этим жить в настоящем. Я просто хочу сказать тебе, что раньше в голове всегда была мысль: «А как же без психолога? Когда я смогу самостоятельно управлять жизнью и принимать осознанные решения?«. Сколько лет еще должно пройти?». Благодаря нашей работе я научилась доверять себе, видеть себя настоящей, начала слышать тот внутренний голос не палача, а голос который сочувствует, поддерживает меня, говорит что ошибаться это нормально ... что я могу сама себе позволять все, что я хочу ... И я знаю, что ошибки еще будут, но воры мои. я знаю, что будут иногда сомнения, но я справлюсь, я знаю что мне не нужен «кто-то», чтобы быть счастливой, любимой, услышанной, я знаю что это все я могу дать себе сама. Я столько лет жила в страхе, что кто думает, что будет в будущем, а если все получится не так как я планирую... А теперь мое главное правило, идти на встречу страху и посмотреть что будет? А будет выход из зоны комфортна, развитие, самореализация и осознание своей невероятной силы внутри себя. Спасибо тебе за меня.🫵❤️",
		"therapy.name10": "Натали",
		"therapy.slide11":
			"Очень рада, что обратилась именно к вам 😌Вы очень добрый и квалифицированный специалист ❤️все четко и по делу ✍️уверенна что именно с вами я достигну желаемой цели 🎯было всего несколько созвонов, но в голове уже очень многое поменялось 💝",
		"therapy.name11": "Ксения",
		"therapy.slide12":
			"К Насте я обратился, когда психическое состояние начало мешать чувствовать себя полноценным и способным быть счастливым. Много часов я провел, слушая подкаст Про Башку и, когда сформировал свой собственный запрос - решил написать Насте лично. После нескольких сеансов мое состояние было похоже на первые минуты пробуждения. Протирая заспанные глаза, я вижу яркий теплый свет, к которому еще должен привыкнуть. И главное, что этот свет я вижу в отражении. Спасибо Насте за ее работу!",
		"therapy.name12": "Артём",

		// Quizzes
		"quizzes.mainTitle": "Психологические тесты",
		"quizzes.title1": "Тест “Выгорание на рабочем месте” (CBI)",
		"quizzes.description1":
			'Короткий тест на 19 вопросов, который покажет на какой стадии выгорания вы сейчас "вероятно" находитесь.',
		"quizzes.subDescription": "*тест не является диагнозом, а скорее подсказкой к действия",
		"quizzes.link": "Пройти тест",
		"quizzes.title2": "Тест “На наличие детских травм”",
		"quizzes.description2":
			"Тест, который поможет определить, какие детские травмы, мешают во взрослой жизни.",
		"quizzes.title3": "Тест “Наличие Трудоголизма”",
		"quizzes.description3":
			"Тест на трудоголизм который сможет показать отличие здорово энтузиазма к работе и идеалистического требования к себе как сотруднику.",

		// Quiz
		"quiz.back": "Назад",
		"quiz.next": "Далее",
		"quiz.label1": "В детстве",
		"quiz.label2": "Сейчас",
		"quiz.option": "Выберите ответ",
		"quiz.skip": "Пропустить",
		"quiz.save": "Сохранить результат в личном кабинете?",
		"quiz.inputPlaceholder": "Введите e-mail",
		"quiz.submit": "Сохранить результат",
		"quiz.results": "Результаты теста",
		"quiz.description":
			"Чем выше балл у ловушки вы получили тем, вероятно, сильнее она влияет на вашу жизнь. Вы можете прочитать больше о каждой из важных для вас ловушек ниже.",
		"quiz.about1": "Вероятнее у вас есть склонность к ловушкам",
		"quiz.about2": "У вас нет ловушки",
		"quiz.resultHeader": "Результаты теста",
		"quiz.errorResultHeader": "Не удалось найти результат для этого идентификатора",
		"quiz.userState": "Оценка состояния по баллам",
		"quiz.statePosition": "👈 Вы тут",
		"quiz.therapyBtn": "Записаться на терапию",
		"quiz.resultShare": "Ты можешь поделиться своим результатом со мной, например в Telegram",
		"quiz.resultLink": "Поделиться результатом",
		"quiz.copy": "Ссылка скопирована",
		"quiz.copyError": "Не работает буфер обмена",
		"quiz.copyTitle": "Результаты тестирования",
		"quiz.error1": "Пожалуйста, ответьте на все вопросы, прежде чем перейти к результату.",
		"quiz.error2": "Не удалось отправить тест. Попробуйте позже.",

		// Quiz1
		"quiz1.title": "Выгорание",

		// Quiz2
		"quiz2.title": "Детские травмы",

		// Quiz3
		"quiz3.title": "Трудоголизм",
		"quiz3.description1":
			"Трудоголизм является такой же формой саморазрушения, как и другие зависимости. Он приводит к переутомлению, нехватке сил на другие занятия и сужению круга интересов. Все вытесняет необходимость чувствовать себя очень нужным, незаменимым в определенных делах. Трудоголикам некогда и неинтересно пользоваться результатами своего труда, они постоянно жертвуют собственными потребностями. Многие из них счастливы, когда о них говорят, что они «горят на работе» и завидуют тем, кому удалось умереть на трудовом посту.",
		"quiz3.description2":
			"К трудоголизму более склонны старшие или единственные дети в семье, где отец – алкоголик, а мать – созависимая. Ребенок выполняет множество обязанностей по дому, старается хорошо учиться, чтобы компенсировать позор семьи, усиленно готовится в престижный вуз или добивается спортивных побед. Он лишает себя отдыха и развлечений, становится антиподом отцу. Но это только внешне, основа у трудоголизма и алкоголизма общая: бегство в зависимость, саморазрушение.",

		// Workshops
		"workshops.title": "Мои семинары",
		"workshops.tooltip": "Кто ведет семинары",
		"workshops.tooltipName1": "Настя",
		"workshops.tooltipAbout1": "кпт/рэпт психотерапевтка и коуч",
		"workshops.tooltipName2": "Лера Суета",
		"workshops.tooltipAbout2": "донецкая бомжиха",
		"workshops.description1":
			"Я уже провела четыре семинара, записи которых можно купить по отдельности. Также можно купить все записи одним пакетом за 2000 ₴",
		"workshops.descriptionSpan1": "вот здесь",
		"workshops.description2.1": "Также у меня есть",
		"workshops.descriptionLink": "Воркбук «Про Башку»",
		"workshops.description2.2":
			"который помогает самостоятельно уметь формировать четко запросы/цели/мечты/пожелания. Его ты можешь приобрести c 50% скидкой, если покупаешь Пакет «4 семинара»",

		"workshopCard.tag1": "проведен:",
		"workshopCard.tag2": "будет:",
		"workshopCard.date": "дата",
		"workshopCard.start": "старт",
		"workshopCard.startText": "по Киеву",
		"workshopCard.time": "тайминг",
		"workshopCard.timeText": "часа",
		"workshopCard.price": "цена",
		"workshopCard.buy1": "Купить запись",
		"workshopCard.buy2": "Купить",

		"allWorkshops.tag": "Экономия",
		"allWorkshops.title": "Пакет “4 семинара”",
		"allWorkshops.text": "/ пакет",
		"allWorkshops.description": "В пакет входит:",
		"allWorkshops.price1": "за",
		"allWorkshops.price2": "можно купить пакет",
		"allWorkshops.btn": "Купить",

		// Workbook
		"workbook.title": "Воркбук «Про Башку»",
		"workbook.subTitle1": "Кому нужен воркбук?",
		"workbook.li1": "Всем тревожным пирожочкам, которые:",
		"workbook.subLi1": "Не знают, за что хвататься в жизни",
		"workbook.subLi2": "Не понимают, что их ждет дальше",
		"workbook.subLi3": "Не умеют себя любить и постоянно тревожатся",
		"workbook.li2": "Всем, кто хочет улучшить свое финансовое положение, но:",
		"workbook.subLi4": "Не верят, что смогут",
		"workbook.subLi5": "Уверены, что никому не нужны и умрут бомжами",
		"workbook.subLi6": "Думают, что деньги только у мажоров, а им не суждено зарабатывать",
		"workbook.li3": "Всем, кто хочет прекрасных отношений, но:",
		"workbook.subLi7": "Давно одиноки и якобы отпугивают нормальных мужчин или с венцом безбрачия",
		"workbook.subLi8": "С “тревожным типом привязанности”",
		"workbook.subLi9": "Боятся мужчин/женщин, тк хороших всех разобрали",
		"workbook.li4": "Запутались в жизни и:",
		"workbook.subLi10": "Вас никто не понимает, нет никакой поддержки",
		"workbook.subLi11": "Нет сил ничего делат",
		"workbook.subLi12": "Не знают как дальше жить",
		"workbook.description": "Короче, воркбук для всех!",
		"workbook.btnText": "Воркбук «Про Башку»",
		"workbook.btnClick": "Купить",
		"workbook.cardTitle1": "Воркбук «Про башку»",
		"workbook.cardText1": "PDF-файл воркбука",
		"workbook.cardText2": "Пакет «4 семинара» (Самооценка, Травмы, Отношения, Карьера)",
		"workbook.cardTitle2": "4 семинара + Воркбук «Про башку»",
		"workbook.subDescription": "Покупая пакет «4 семинара» — забирай воркбук со",
		"workbook.subDescriptionSpan1": "скидкой 50%,",
		"workbook.detailTitle1": "Чем полезен воркбук?",
		"workbook.detailText1":
			"Он помогает смотреть на все свои сферы жизни осознанно, без страха, не избегая острых углов. С ним получится понять, чего мне сейчас не хватает в жизни, сформировать постепенный план по достижению целей и реализовать все запланированное, без срывов и перегибов.",
		"workbook.detailTitle2": "Что я получу по итогу?",
		"workbook.detailText2":
			"95% пользователей воркбука отметили, что после работы с ним снижается уровень фоновой тревоги непонятно от чего, все становится на свои места, перестаютс формироваться непонятные страхи, развивается навык более глубокого понимания себя и своих ценностей, потребностей, желаний. По итогу, жизнь становится лучше, более подконтрольной и осмысленной и счастливой.",
		"workbook.detailTitle3": "Как им пользоваться?",
		"workbook.li5":
			"Распечатываем воркбук, это обязательное и самое важно в работе с ним. Когда мы пишем рукой, что мы думаем, хотим, мечтаем, мы находимся именно в этом моменте максимально осознанно. Писать ручкой в нынешнее время особый вид терапии.",
		"workbook.li6":
			"Отвечаем максимально откровенно на все вопросы, пишем столько, сколько приходит в голову ответов, чем больше, тем лучше. Если на какие-то вопросы не получается сразу ответить с головы, смотрите пример заполненного воркбука.",
		"workbook.li7": "Формируем цели, планы, мечты, которые нам сейчас так нужны.",
		"workbook.li8": "Составляем план из мелких внедрений, шажков, изменений на пути к свой цели.",
		"workbook.li9":
			"Начинаем внедрять все вышеперечисленной в жизни и отмечаем успехи и изменения по ходу дела.",
		"workbook.detailText3":
			"В воркбуке вы найдете qr на дополнительные материалы, которые смогут вам помочь в его заполнении. Не откладывайте ваше благополучие в долгий ящик, жизнь одна, пережить ее не получится. Всех благ! ✨",
		"workbook.subTitle3": "Блогеры, которые выбрали воркбук",
		"workbook.blogerText": "Стать моим партнёром",
		"workbook.blogerTextSpan": "Связаться",

		// Subbotnik
		"subbotnik.title": "Курс «Для Башки»",
		"subbotnik.subTitle1": "Что вы получаете?",
		"subbotnik.subTitle2": "Что мы будем разбирать?",
		"subbotnik.description1": "В течении месяца (8 встреч) будем разбираться со всеми жизненными проблемами.",
		"subbotnik.description2": "Встречи будут проходить по выходным (~2 часа времени закладывайте)",
		"subbotnik.description3": "В дз входит литература + техники + воркбук + статьи",
		"subbotnik.description4":
			"У нас будет группа, где все всегда смогут задавать вопросы, делиться инфой, переживаниями и что угодно, со мной на связи все время пока я не сплю)))",
		"subbotnik.description5": "На всякий случай скажу, кто ничего не делает, у того ничего и не меняется :)",
		"subbotnik.name1": "Воскресенье",
		"subbotnik.name2": "Суббота",
		"subbotnik.about1": "основная лекция по теме +",
		"subbotnik.about2": "вопросы + дз",
		"subbotnik.about3": "проверяем дз + разбираем что",
		"subbotnik.about4": "непонятно + болтаем",
		"subbotnik.info": "ВСЕМ УЧАСТНИКАМ ВОРКБУК В ПИДАРУНОК!",
		"subbotnik.li1":
			"Понимание как быть норм Джеки Чаном и как жить весело, и счастливо без тревоги и бесконечных страданий",
		"subbotnik.li2": "Экономия денежек (8 сессий со мной стоят 25 600 ₴)",
		"subbotnik.li3": "Инструменты которые будут служить вам всю жизнь",
		"subbotnik.li4": "Поддерживающее комьюнити",
		"subbotnik.li5": "Воркбук",
		"subbotnik.li6": "Книги",

		"subbotnikTopic.title1": "Детство",
		"subbotnikTopic.title2": "Самооценка",
		"subbotnikTopic.title3": "Карьера",
		"subbotnikTopic.title4": "Отношения",
		"subbotnikTopic.li1": "Травмы",
		"subbotnikTopic.li2": "Когнитивные ошибки",
		"subbotnikTopic.li3": "Здоровая сепарация",
		"subbotnikTopic.li4": "Последствия",
		"subbotnikTopic.li5": "Как перестать себя задрачивать (селфхарм, рпп и прочие прЕколы)",
		"subbotnikTopic.li6": "Как понять “кто я”",
		"subbotnikTopic.li7": "Как найти в себе силы",
		"subbotnikTopic.li8": "Как себя любить",
		"subbotnikTopic.li9": "Как зарабатывать бабки",
		"subbotnikTopic.li10": "Как зарабатывать и чтобы масик сыпал монетку",
		"subbotnikTopic.li11": "Как не бояться проявляться",
		"subbotnikTopic.li12": "Как найти себя",
		"subbotnikTopic.li13": "Секс (ой тут я могу годы рассказывать)",
		"subbotnikTopic.li14": "Партнерские отношения",
		"subbotnikTopic.li15": "Кто что кому должен",
		"subbotnikTopic.li16": "Ревность",

		"subbotnikCard.title": "Курс “Для Башки”",
		"subbotnikCard.description": "Проводится небольшой группой каждые выходные",
		"subbotnikCard.detail1": "старт",
		"subbotnikCard.detail2": "тайминг",
		"subbotnikCard.detail3": "часа",
		"subbotnikCard.detail4": "время",
		"subbotnikCard.detail5": "окончание",
		"subbotnikCard.detail6": "(по Киеву)",
		"subbotnikCard.btn": "Купить за 4 999 ₴",

		// WorkshopModal
		"workshopModal.title": "Форма оплаты",
		"workshopModal.email": "Введите почту, на которую прийдет доступ",
		"workshopModal.oneWorkshopTitle": "Семинар",
		"workshopModal.allWorkshop": "Выгодный пакет «4 семинара»",
		"workshopModal.allWorkshopTitle": "Пакет «4 семинара» + воркбук (скидка 50%)",
		"workshopModal.workbook": "Докупи воркбук по скидке",
		"workshopModal.workbookDescription": "+ Ворбук «Про Башку» (скида 50%)",
		"workshopModal.promoPlaceholder": "Введите промокод",
		"workshopModal.applyPromoCode": "Применить",
		"workshopModal.promoError": "Неправильный промокод",
		"workshopModal.result": "К оплате",
		"workshopModal.btn": "Оплатить",

		// Thank you
		"thankYou.title": "Юху, оплата прошла успешно :)",
		"thankYou.titleError1": "Данные о заказе не найдены",
		"thankYou.titleError2": "Ошибка при оплате",
		"thankYou.description": "К сожалению, оплата не прошла :(",
		"thankYou.email": "Письмо отправлено на почту",
		"thankYou.link": "Перейти в личный кабинет",
		"thankYou.bundle": "Пакет «4 семинара»",
		"thankYou.seminarOld": "Посмотреть запись можно в личном кабинете",
		"thankYou.seminarNew": "Ссылка на Zoom прийдет на почту в день семинара",
		"thankYou.seminarsOld": "Посмотреть записи можно в личном кабинете",
		"thankYou.workBook": "Скачать воркбук можно в личном кабинете",
		"thankYou.groupTherapy": "Ссылка на Telegram канал прийдет на почту",

		// Dashboard
		"dashboard.name": "Личный кабинет",
		"dashboard.logout": "Выйти",
		"dashboard.tab1": "Покупки",
		"dashboard.tab2": "Курс",
		"dashboard.tab3": "Тесты",
		"dashboard.title1": "Актуальные предложения",
		"dashboard.title2": "Воркбук «Про Башку»",
		"dashboard.title3": "Купленные семинары",
		"dashboard.title4": "Результаты тестов",
		"dashboard.title5": "Курс «Для Башки»",
		"dashboard.description1": "У вас есть такие ловушки:",
		"dashboard.description2": "Ваша оценка состояния по баллам",
		"dashboard.description3": "У вас нет ловушек",
		"dashboard.link": "Посмотреть полностью",
		"dashboard.navigation": "Показаны",
		"dashboard.option1": "Украинский",
		"dashboard.option2": "Русский",
		"dashboard.open": "Открыть видео",
		"dashboard.time": "будет",
		"dashboard.week": "-ая неделя",

		"dashboardLogin.title": "Войти в личный кабинет",
		"dashboardLogin.help": "Мы отправили код на почту",
		"dashboardLogin.email": "Введите свой e-mail",
		"dashboardLogin.otp": "Введите код",
		"dashboardLogin.next": "Далее",
		"dashboardLogin.login": "Войти",
		"dashboardLogin.back": "Назад",
		"dashboardLogin.or": "или",
		"dashboardLogin.google": "Войти с помощью Google",

		"dashboardWorkbook.titel": "Скачать воркбук",
		"dashboardWorkbook.text1": "пустой",
		"dashboardWorkbook.text2": "заполненный",

		"dashboardEmpty.title1": "Упс, вы пока ничего не купили :(",
		"dashboardEmpty.title2": "Упс, вы еще не проходили тестов :(",
		"dashboardEmpty.description1":
			"Сейчас у вас ничего не куплено, но это можно исправить купив любой из доступных продуктов:",
		"dashboardEmpty.description2":
			"Вы можете пройти тесты и сохранить свои результаты здесь, чтобы в дальнейшем работать с этими результатами",
		"dashboardEmpty.link1": "Семинары",
		"dashboardEmpty.link2": "Воркбук",
		"dashboardEmpty.link3": "Субботник",
		"dashboardEmpty.link4": "Пройти тесты",

		// 404
		"404.title": "Упс! Страница не найдена.",
		"404.text": "К сожалению, мы не смогли найти страницу, которую вы искали.",
		"404.link": "Вернуться на главную страницу",

		// Errors
		"errors.sendData": "Ошибка при отправке данных",
		"errors.sendGoogleData": "Ошибка при авторизации через Google",
		"errors.sendEmailData": "Ошибка при отправке e-mail",
		"errors.sendOtpData": "Ошибка при отправке otp",
	},
} as const;
