type RatingType = {
	requiredPoints: number;
	result: {
		ru: string;
		ua: string;
	};
	description?: {
		ru: string[];
		ua: string[];
	};
	characteristics: {
		ru: string[];
		ua: string[];
	};
};

export const quiz = {
	title: {
		ru: "Тест “На наличие детских травм”",
		ua: "Тест “На наявність дитячих травм”",
	},
	shortTitle: {
		ru: "Тест “На наличие детских травм”",
		ua: "Тест “На наявність дитячих травм”",
	},
	description: {
		ru: "Тест поможет вам определить, какие ловушки сильнее всего проявляются в вашей жизни.",
		ua: "Тест допоможе вам визначити, які пастки найсильніше проявляються у вашому житті.",
	},
	sections: {
		"1": {
			title: {
				ru: "Тест “На наличие детских травм”",
				ua: "Тест “На наявність дитячих травм”",
			},
			description: {
				ru: "Тест поможет вам определить, какие ловушки сильнее всего проявляются в вашей жизни.",
				ua: "Тест допоможе вам визначити, які пастки найсильніше проявляються у вашому житті.",
			},
			questions: {
				"1": {
					text: {
						ru: "Я привязан к близким людям, потому что боюсь, что они меня бросят.",
						ua: "Я прив'язаний до близьких людей, тому що боюся, що вони мене кинуть.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"2": {
					text: {
						ru: "Я сильно переживаю, что любимые люди найдут кого-то другого и бросят меня.",
						ua: "Я сильно переживаю, що кохані люди знайдуть когось іншого і кинуть мене.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"3": {
					text: {
						ru: "Я обычно думаю о том, какие внутренние мотивы движут людьми; мне непросто доверять людям.",
						ua: "Я зазвичай думаю про те, які внутрішні мотиви рухають людьми; мені непросто довіряти людям.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"4": {
					text: {
						ru: "Мне кажется, что с людьми всегда нужно быть начеку, иначе они могут причинить мне боль.",
						ua: "Мені здається, що з людьми завжди потрібно бути напоготові, інакше вони можуть завдати мені болю.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"5": {
					text: {
						ru: "Я сильнее других переживаю из-за опасностей — что я заболею или мне будет причинен какой-либо вред.",
						ua: "Я сильніше за інших переживаю через небезпеку - що я захворію або мені буде заподіяно якусь шкоду.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"6": {
					text: {
						ru: "Я боюсь, что я (или моя семья) останусь без денег и буду испытывать сильную нужду или начну зависеть от других.",
						ua: "Я боюся, що я (або моя сім'я) залишуся без грошей і буду відчувати сильну нужду або почну залежати від інших.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"7": {
					text: {
						ru: "Мне кажется, что я с трудом смогу жить самостоятельно, и я чувствую, что мне нужна помощь других людей.",
						ua: "Мені здається, що я насилу зможу жити самостійно, і я відчуваю, що мені потрібна допомога інших людей.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"8": {
					text: {
						ru: "Я и мои родители были склонны слишком сильно углубляться в проблемы друг друга.",
						ua: "Я і мої батьки були схильні занадто сильно заглиблюватися в проблеми одне одного.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"9": {
					text: {
						ru: "В моей жизни не было человека, который заботился бы обо мне, уделял мне время или серьезно переживал о том, что со мной происходит.",
						ua: "У моєму житті не було людини, яка дбала б про мене, приділяла мені час або серйозно переживала про те, що зі мною відбувається.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"10": {
					text: {
						ru: "Люди не удовлетворяли моих эмоциональных потребностей в понимании, сочувствии, наставлении, советах и поддержке.",
						ua: "Люди не задовольняли моїх емоційних потреб у розумінні, співчутті, настанові, порадах і підтримці.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"11": {
					text: {
						ru: "Мне кажется, что мне нигде нет места. Я не такой, как все. Я никуда не вписываюсь.",
						ua: "Мені здається, що мені ніде немає місця. Я не такий, як усі. Я нікуди не вписуюся.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"12": {
					text: {
						ru: "Я скучный и занудный; я не знаю, о чем разговаривать с людьми.",
						ua: "Я нудний і занудний; я не знаю, про що розмовляти з людьми.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"13": {
					text: {
						ru: "Те, кто мне нравится, никогда не любили меня настоящего, со всеми моими недостатками.",
						ua: "Ті, хто мені подобається, ніколи не любили мене справжнього, з усіма моїми недоліками.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"14": {
					text: {
						ru: "Я стыжусь себя; я не заслуживаю любви, внимания и уважения других.",
						ua: "Я соромлюся себе; я не заслуговую на любов, увагу і повагу інших.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"15": {
					text: {
						ru: "Я не такой умный или умелый, как большинство людей, когда дело касается работы (или учебы).",
						ua: "Я не такий розумний чи вправний, як більшість людей, коли справа стосується роботи (чи навчання).",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"16": {
					text: {
						ru: "Я часто чувствую себя неполноценным, потому что другие люди талантливее, умнее и успешнее меня.",
						ua: "Я часто почуваюся неповноцінним, тому що інші люди талановитіші, розумніші й успішніші за мене.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"17": {
					text: {
						ru: "Мне кажется, что у меня нет выбора — нужно выполнять желания других людей, иначе они отомстят или каким-то образом отвергнут меня.",
						ua: "Мені здається, що в мене немає вибору - потрібно виконувати бажання інших людей, інакше вони помстяться або якимось чином відкинуть мене.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"18": {
					text: {
						ru: "Люди считают, что я делаю слишком много для других и недостаточно для себя.",
						ua: "Люди вважають, що я роблю занадто багато для інших і недостатньо для себе.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"19": {
					text: {
						ru: "Я стремлюсь к идеалу; средний результат меня не устроит. Я хочу быть лучше всех в своем деле.",
						ua: "Я прагну до ідеалу; середній результат мене не влаштує. Я хочу бути кращим за всіх у своїй справі.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"20": {
					text: {
						ru: "Мне нужно столько сделать, что у меня почти нет времени расслабиться и по-настоящему повеселиться.",
						ua: "Мені потрібно стільки зробити, що у мене майже немає часу розслабитися і по-справжньому повеселитися.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"21": {
					text: {
						ru: "Я считаю, что мне не нужно подчиняться правилам и нормам, как другим людям.",
						ua: "Я вважаю, що мені не потрібно підкорятися правилам і нормам, як іншим людям.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
				"22": {
					text: {
						ru: "Мне не хватает дисциплины, чтобы выполнять рутинные, скучные задачи или контролировать свои эмоции.",
						ua: "Мені не вистачає дисципліни, щоб виконувати рутинні, нудні завдання або контролювати свої емоції.",
					},
					answers: {
						"1": {
							text: {
								ru: "Совершенно не обо мне",
								ua: "Зовсім не про мене",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "В основном неверно",
								ua: "Здебільшого невірно",
							},
							points: 2,
						},
						"3": {
							text: {
								ru: "Скорее верно, чем неверно",
								ua: "Швидше правильно, ніж неправильно",
							},
							points: 3,
						},
						"4": {
							text: {
								ru: "Верно в небольшой степени",
								ua: "Вірно невеликою мірою",
							},
							points: 4,
						},
						"5": {
							text: {
								ru: "В основном верно",
								ua: "Здебільшого вірно",
							},
							points: 5,
						},
						"6": {
							text: {
								ru: "Идеально описывает меня",
								ua: "Ідеально описує мене",
							},
							points: 6,
						},
					},
				},
			},
		},
	},
	ratings: [
		{
			requiredPoints: 1,
			result: {
				ru: "Отверженность",
				ua: "Знедоленість",
			},
			description: {
				ru: [
					"Отверженность",
					"и",
					"Недоверие",
					"— ловушки, которые связаны с недостатком безопасности и спокойствия в семье, где вы росли",
				],
				ua: [
					"Знедоленість",
					"і",
					"Недовіра",
					"- пастки, які пов'язані з нестачею безпеки і спокою в сім'ї, де ви росли",
				],
			},
			characteristics: {
				ru: [
					"Ловушка Отверженности - это ощущение, что люди, которых вы любите, бросят вас и вы навсегда останетесь в эмоциональной изоляции. Близкие умрут, навсегда уйдут из дома или предпочтут кого-то другого, - вас так или иначе оставят одного. Из-за этого убеждения вы цепляетесь за близких людей, но таким образом только отталкиваете их от себя. Даже недолгая разлука сильно расстраивает или злит вас.",
				],
				ua: [
					"Пастка Знедоленості - це відчуття, що люди, яких ви кохаєте, кинуть вас і ви назавжди залишитеся в емоційній ізоляції. Близькі помруть, назавжди підуть з дому або віддадуть перевагу комусь іншому, - вас так чи інакше залишать одного. Через це переконання ви чіпляєтеся за близьких людей, але таким чином тільки відштовхуєте їх від себе. Навіть недовга розлука сильно засмучує або злить вас.",
				],
			},
		},
		{
			requiredPoints: 2,
			result: {
				ru: "Недоверие и жестокое обращение",
				ua: "Недовіра та жорстоке поводження",
			},
			characteristics: {
				ru: [
					"Ловушка Недоверия и жестокого обращения - это ожидание, что люди обидят вас или каким-то образом навредят вам; изменят, обманут, будут манипулировать, унижать, бить или каким-то образом использовать вас. Попав в нее, вы защищаетесь, спрятавшись за стеной недоверия. Вы никого не подпускаете близко. Вы подозрительно относитесь к намерениям людей и склонны предполагать худшее. Вы ждете, что люди, которых вы любите, предадут вас. Вы либо совсем избегаете отношений и не слишком открываетесь другим, либо вступаете в отношения с людьми, которые плохо к вам относятся, а потом злитесь на них и желаете им отомстить.",
				],
				ua: [
					"Пастка Недовіри та жорстокого поводження - це очікування, що люди образять вас або якимось чином зашкодять вам; змінять, обдурять, маніпулюватимуть, принижуватимуть, битимуть або якимось чином використовуватимуть вас. Потрапивши в неї, ви захищаєтеся, сховавшись за стіною недовіри. Ви нікого не підпускаєте близько. Ви підозріло ставитеся до намірів людей і схильні припускати найгірше. Ви чекаєте, що люди, яких ви любите, зрадять вас. Ви або зовсім уникаєте стосунків і не надто відкриваєтеся іншим, або вступаєте в стосунки з людьми, які погано до вас ставляться, а потім злитеся на них і бажаєте їм помститися.",
				],
			},
		},
		{
			requiredPoints: 3,
			result: {
				ru: "Зависимость",
				ua: "Залежність",
			},
			description: {
				ru: [
					"Зависимость",
					"и",
					"Уязвимость",
					"— ловушки, которые связаны с вашей способностью существовать независимо от других",
				],
				ua: [
					"Залежність",
					"і",
					"Уразливість",
					"- пастки, які пов'язані з вашою здатністю існувати незалежно від інших",
				],
			},
			characteristics: {
				ru: [
					"Попав в ловушку Зависимости, вы чувствуете, что неспособны справиться с повседневной жизнью без посторонней помощи. Вы полагаетесь на других, как на костыли, и вам нужна постоянная поддержка. В детстве вы пытались отстоять свою независимость, а вас заставили почувствовать себя беспомощным. Теперь вы ищете сильных людей, на которых можно положиться и отдать свою жизнь в их руки. На работе вы избегаете самостоятельных заданий. Нечего и говорить, что из-за этого вы проигрываете.",
				],
				ua: [
					"Потрапивши в пастку Залежності, ви відчуваєте, що нездатні впоратися з повсякденним життям без сторонньої допомоги. Ви покладаєтеся на інших, як на милиці, і вам потрібна постійна підтримка. У дитинстві ви намагалися відстояти свою незалежність, а вас змусили відчути себе безпорадним. Тепер ви шукаєте сильних людей, на яких можна покластися і віддати своє життя в їхні руки. На роботі ви уникаєте самостійних завдань. Годі й казати, що через це ви програєте.",
				],
			},
		},
		{
			requiredPoints: 4,
			result: {
				ru: "Уязвимость",
				ua: "Уразливість",
			},
			characteristics: {
				ru: [
					"С Уязвимостью вы живете в страхе, что вот-вот случится катастрофа - природная, криминальная, медицинская или финансовая. Вы попали в эту ловушку, потому что в детстве вас научили, что мир - это опасное место. Вероятно, родители чрезмерно опекали вас из страха за ваше благополучие. Ваши страхи огромны и нереалистичны, но вы позволяете им контролировать вашу жизнь и очень много энергии тратите на безопасность. Вы можете бояться болезни, панической атаки, СПИДа или безумия. Вы переживаете, что обеднеете и будете просить подаяния на улицах. Ваша уязвимость может быть связана и с другими фобиями, например страхом полетов, уличных грабителей или землетрясений.",
				],
				ua: [
					"З Уразливістю ви живете в страху, що ось-ось трапиться катастрофа - природна, кримінальна, медична або фінансова. Ви потрапили в цю пастку, тому що в дитинстві вас навчили, що світ - це небезпечне місце. Ймовірно, батьки надмірно опікувалися вами зі страху за ваше благополуччя. Ваші страхи величезні й нереалістичні, але ви дозволяєте їм контролювати ваше життя і дуже багато енергії витрачаєте на безпеку. Ви можете боятися хвороби, панічної атаки, СНІДу або божевілля. Ви переживаєте, що збіднієте і будете просити милостині на вулицях. Ваша вразливість може бути пов'язана і з іншими фобіями, наприклад страхом польотів, вуличних грабіжників або землетрусів.",
				],
			},
		},
		{
			requiredPoints: 5,
			result: {
				ru: "Эмоциональная депривация",
				ua: "Емоційна депривація",
			},
			description: {
				ru: [
					"Эмоциональная депривация",
					"и",
					"Изгнание из общества",
					"— ловушки, которые связаны с силой эмоциональной привязанности к другим",
				],
				ua: [
					"Емоційна депривація",
					"і",
					"Вигнання із суспільства",
					"- пастки, які пов'язані із силою емоційної прив'язаності до інших",
				],
			},
			characteristics: {
				ru: [
					"Эмоциональная депривация - это вера в то, что другие люди никогда не смогут удовлетворить вашу потребность в любви. Вам кажется, что никто о вас не заботится и вас не понимает. Вас тянет к холодным и равнодушным людям, или вы сами холодны и равнодушны, а это приводит к неудовлетворенности в отношениях. Вы чувствуете себя обманутым; то злитесь, то страдаете от боли и одиночества. По иронии судьбы, ваша злость только сильнее отталкивает людей, продлевая вашу депривацию.",
					"Когда пациенты с эмоциональной депривацией приходят на терапевтические сессии, их тоска как будто остается с нами после их ухода. Это ощущение опустошенности и эмоциональной оторванности. Это люди, которые не знают, что такое любовь.",
				],
				ua: [
					"Емоційна депривація - це віра в те, що інші люди ніколи не зможуть задовольнити вашу потребу в любові. Вам здається, що ніхто про вас не піклується і вас не розуміє. Вас тягне до холодних і байдужих людей, або ви самі холодні й байдужі, а це призводить до незадоволеності у стосунках. Ви відчуваєте себе обдуреним; то злитеся, то страждаєте від болю і самотності. За іронією долі, ваша злість тільки сильніше відштовхує людей, продовжуючи вашу депривацію.",
					"Коли пацієнти з емоційною депривацією приходять на терапевтичні сесії, їхня туга начебто залишається з нами після того, як вони йдуть. Це відчуття спустошеності та емоційної відірваності. Це люди, які не знають, що таке любов.",
				],
			},
		},
		{
			requiredPoints: 6,
			result: {
				ru: "Изгнание из общества",
				ua: "Вигнання із суспільства",
			},
			characteristics: {
				ru: [
					"Изгнание из общества - ловушка ваших отношений с друзьями и социальными группами. Вам кажется, что вы изолированы от остального мира, вы чувствуете себя иным. Если вы попали в эту ловушку, то в детстве вас, вероятно, отвергали сверстники. У вас не было друзей, или некая необычная черта заставляла вас чувствовать себя непохожим на других. Во взрослом возрасте вы, скорее всего, поддерживаете свою ловушку, избегая социальных контактов. Вы не общаетесь в компаниях и не заводите друзей.",
					"Вы могли чувствовать себя отверженным, потому что другим детям в вас что-то не нравилось и вы чувствовали себя нежелательным элементом общества. Во взрослом возрасте вы можете ощущать, что вы уродливы, несексуальны, у вас низкий статус, вы обладаете слабыми навыками общения, скучны или как-то иначе неполноценны. Общаясь, вы воспроизводите свою детскую отверженность - чувствуете себя и поступаете так, будто вы хуже других.",
					"Ловушка Изгнания из общества не всегда очевидна. Многие люди довольно комфортно чувствуют себя с ней и вполне успешны в общении. Их ловушка может не проявляться в личных отношениях. Иногда мы удивляемся, обнаружив, как тревожно и одиноко им на вечеринках, в классах, на встречах или на работе. Они испытывают беспокойство, ищут и не могут найти себе места.",
				],
				ua: [
					"Вигнання із суспільства - пастка ваших стосунків із друзями та соціальними групами. Вам здається, що ви ізольовані від решти світу, ви відчуваєте себе іншим. Якщо ви потрапили в цю пастку, то в дитинстві вас, імовірно, відкидали однолітки. У вас не було друзів, або якась незвичайна риса змушувала вас почуватися несхожим на інших. У дорослому віці ви, найімовірніше, підтримуєте свою пастку, уникаючи соціальних контактів. Ви не спілкуєтеся в компаніях і не заводите друзів.",
					"Ви могли відчувати себе знедоленим, тому що іншим дітям у вас щось не подобалося, і ви відчували себе небажаним елементом суспільства. У дорослому віці ви можете відчувати, що ви потворні, несексуальні, маєте низький статус, маєте слабкі навички спілкування, нудні або якось інакше неповноцінні. Спілкуючись, ви відтворюєте свою дитячу знедоленість - відчуваєте себе і чините так, ніби ви гірші за інших.",
					"Пастка Вигнання із суспільства не завжди очевидна. Багато людей досить комфортно почуваються з нею і цілком успішні в спілкуванні. Їхня пастка може не проявлятися в особистих стосунках. Іноді ми дивуємося, виявивши, як тривожно і самотньо їм на вечірках, у класах, на зустрічах або на роботі. Вони відчувають занепокоєння, шукають і не можуть знайти собі місця.",
				],
			},
		},
		{
			requiredPoints: 7,
			result: {
				ru: "Неполноценность",
				ua: "Неповноцінність",
			},
			description: {
				ru: ["Неполноценность", "и", "Несостоятельность", "— ловушки, которые касаются вашей самооценки"],
				ua: ["Неповноцінність", "і", "Неспроможність", "- пастки, які стосуються вашої самооцінки"],
			},
			characteristics: {
				ru: [
					"С Неполноценностью вы чувствуете, что на глубинном уровне у вас есть изьяны и недостатки. Вы уверены, что если кто-то приблизится к вам, он уже не сможет вас полюбить - ваша ущербность вылезет наружу. В детстве вы не чувствовали, что в семье вас уважают. Вместо этого вас критиковали. Вы винили себя - и чувствовали, что недостойны любви. Во взрослом возрасте вам сложно поверить, что близкие ценят вас; вы ждете, что они вас оттолкнут.",
				],
				ua: [
					"З Неповноцінністю ви відчуваєте, що на глибинному рівні у вас є вади і недоліки. Ви впевнені, що якщо хтось наблизиться до вас, він уже не зможе вас полюбити - ваша ущербність вилізе назовні. У дитинстві ви не відчували, що в родині вас поважають. Замість цього вас критикували. Ви звинувачували себе - і відчували, що не гідні любові. У дорослому віці вам складно повірити, що близькі цінують вас; ви чекаєте, що вони вас відштовхнуть.",
				],
			},
		},
		{
			requiredPoints: 8,
			result: {
				ru: "Несостоятельность",
				ua: "Неспроможність",
			},
			characteristics: {
				ru: [
					"Несостоятельность - это уверенность в том, что вы ничего не достигли по сравнению со сверстниками: ни в школе, ни на работе, ни в спорте. В детстве ваши успехи принижали. Вам было сложно учиться или не хватало усидчивости, чтобы освоить такие важные навыки, как, например, чтение. Другие дети всегда были лучше вас. Вас называли «тупым», «бездарным» или «ленивым». Во взрослом возрасте вы поддерживаете свою ловушку, преувеличивая свои неудачи и ведя себя так, что они продолжаются.",
				],
				ua: [
					"Неспроможність - це впевненість у тому, що ви нічого не досягли порівняно з однолітками: ні в школі, ні на роботі, ні в спорті. У дитинстві ваші успіхи принижували. Вам було складно вчитися або не вистачало посидючості, щоб освоїти такі важливі навички, як, наприклад, читання. Інші діти завжди були кращими за вас. Вас називали «тупим», «бездарним» або «ледачим». У дорослому віці ви підтримуєте свою пастку, перебільшуючи свої невдачі і поводячись так, що вони тривають.",
				],
			},
		},
		{
			requiredPoints: 9,
			result: {
				ru: "Покорность",
				ua: "Покірливість",
			},
			description: {
				ru: [
					"Покорность",
					"и",
					"Завышенные стандарты",
					"— ловушки, которые связаны с самовыражением — возможностью говорить о своих желаниях и добиваться удовлетворения своих насущных потребностей",
				],
				ua: [
					"Покірливість",
					"і",
					"Завищені стандарти",
					"- пастки, які пов'язані із самовираженням - можливістю говорити про свої бажання і домагатися задоволення своїх нагальних потреб",
				],
			},
			characteristics: {
				ru: [
					"С Покорностью вы жертвуете собственными нуждами и желаниями ради удовлетворения потребностей других людей или их удовольствия. Вы позволяете кому-то контролировать вас. Вы делаете это либо из чувства вины за то, что раните других, когда выбираете себя, или из страха, что вас накажут или бросят, если вы не подчинитесь. В детстве близкий человек, вероятно родитель, подчинил вас себе. Во взрослом возрасте вы постоянно завязываете отношения с доминирующими, контролирующими людьми, которым подчиняетесь, или с несостоятельными людьми, неспособными дать вам ничего взамен.",
				],
				ua: [
					"З Покірністю ви жертвуєте власними потребами і бажаннями заради задоволення потреб інших людей або їхнього задоволення. Ви дозволяєте комусь контролювати вас. Ви робите це або з почуття провини за те, що ображаєте інших, коли обираєте себе, або зі страху, що вас покарають або кинуть, якщо ви не підкорятиметеся. У дитинстві близька людина, ймовірно батько, підпорядкувала вас собі. У дорослому віці ви постійно зав'язуєте стосунки з домінуючими, контролюючими людьми, яким підкоряєтесь, або з неспроможними людьми, нездатними дати вам нічого натомість.",
				],
			},
		},
		{
			requiredPoints: 10,
			result: {
				ru: "Завышенные стандарты",
				ua: "Завищені стандарти",
			},
			characteristics: {
				ru: [
					"С Завышенными стандартами вы очень высоко задираете планку и изо всех сил стараетесь не разочароваться в себе. Вы делаете особый акцент на статусе, деньгах, достижениях, внешности, порядке или признании. Для вас они важнее счастья, радости, удовольствия от выполненного дела и полноценных отношений. Вероятно, вы проецируете свои завышенные стандарты на других людей и осуждаете их. В детстве от вас ждали самых лучших результатов, учили, что все остальное - провал. Вы усвоили, что все ваши поступки недостаточно хороши.",
				],
				ua: [
					"Із Завищеними стандартами ви дуже високо задираєте планку і щосили намагаєтеся не розчаруватися в собі. Ви робите особливий акцент на статусі, грошах, досягненнях, зовнішності, порядку або визнанні. Для вас вони важливіші за щастя, радість, задоволення від виконаної справи і повноцінних стосунків. Імовірно, ви проектуєте свої завищені стандарти на інших людей і засуджуєте їх. У дитинстві від вас чекали найкращих результатів, вчили, що все інше - провал. Ви засвоїли, що всі ваші вчинки недостатньо хороші.",
				],
			},
		},
		{
			requiredPoints: 11,
			result: {
				ru: "Избранность",
				ua: "Вибраність",
			},
			description: {
				ru: [
					"Избранность",
					"",
					"",
					"— ловушка, которая связана со способностью воспринимать адекватные жизненные ограничения",
				],
				ua: [
					"Вибраність",
					"",
					"",
					"- пастка, яка пов'язана зі здатністю сприймати адекватні життєві обмеження",
				],
			},
			characteristics: {
				ru: [
					"Последняя ловушка, Избранность, ассоциируется со способностью воспринимать адекватные жизненные ограничения. Люди с этой ловушкой чувствуют себя особенными. Они уверены, что имеют право делать, говорить или получать все, что захотят, причем без промедления. Они отвергают то, что требует времени и терпения, и цену, которую приходится платить за их прихоти другим людям. Им не хватает самодисциплины.",
					"Многих таких людей баловали в детстве. Их не учили контролировать себя или придерживаться определенных рамок. Они выросли, но продолжают сердиться, если не получают желаемого.",
				],
				ua: [
					"Остання пастка, Обраність, асоціюється зі здатністю сприймати адекватні життєві обмеження. Люди з цією пасткою відчувають себе особливими. Вони впевнені, що мають право робити, говорити чи отримувати все, що захочуть, причому без зволікання. Вони відкидають те, що потребує часу й терпіння, і ціну, яку доводиться платити за їхні забаганки іншим людям. Їм бракує самодисципліни.",
					"Багатьох таких людей балували в дитинстві. Їх не вчили контролювати себе або дотримуватися певних рамок. Вони виросли, але продовжують сердитися, якщо не отримують бажаного.",
				],
			},
		},
	],
};

const sectionInfo = Object.values(quiz.sections);

const section = sectionInfo.map((item) => item.questions);

export const questions = section.map((item) => item && Object.values(item).map((item) => item.text));

export const allAnswersWithPoints = section.map(
	(item) =>
		item &&
		Object.values(item).map((questionItem) => ({
			answer: questionItem.text,
			points: questionItem.answers,
		}))
);

const numArray = [];

for (let i = 0; i < sectionInfo.length; i++) {
	numArray.push(i);
}

export const sectionsArray = numArray;

export const answerAndPoints = allAnswersWithPoints[0].map((item) => {
	return {
		answer: item.answer,
		points: Object.keys(item.points).map((point) => {
			const pointValue = point as keyof typeof item.points;
			return item.points[pointValue];
		}),
	};
});

export const finalRatings: RatingType[][] = [];

for (let i = 0; i < quiz.ratings.length; i += 2) {
	const first = quiz.ratings[i];
	const second = quiz.ratings[i + 1];
	const arr = [];

	if (first) arr.push(first);
	if (second) arr.push(second);

	finalRatings.push(arr);
}
