export const quiz = {
	title: {
		ru: "Тест “Наличие Трудоголизма”",
		ua: "Тест “Наявність Трудоголізму”",
	},
	shortTitle: {
		ru: "Тест “Наличие Трудоголизма”",
		ua: "Тест “Наявність Трудоголізму”",
	},
	description: {
		ru: "Трудоголизм является такой же формой саморазрушения, как и другие зависимости. Он приводит к переутомлению, нехватке сил на другие занятия и сужению круга интересов. Все вытесняет необходимость чувствовать себя очень нужным, незаменимым в определенных делах. Трудоголикам некогда и неинтересно пользоваться результатами своего труда, они постоянно жертвуют собственными потребностями. Многие из них счастливы, когда о них говорят, что они «горят на работе» и завидуют тем, кому удалось умереть на трудовом посту. К трудоголизму более склонны старшие или единственные дети в семье, где отец – алкоголик, а мать – созависимая. Ребенок выполняет множество обязанностей по дому, старается хорошо учиться, чтобы компенсировать позор семьи, усиленно готовится в престижный вуз или добивается спортивных побед. Он лишает себя отдыха и развлечений, становится антиподом отцу. Но это только внешне, основа у трудоголизма и алкоголизма общая: бегство в зависимость, саморазрушение.",
		ua: "Трудоголізм є такою ж формою саморуйнування, як і інші залежності. Він призводить до перевтоми, браку сил на інші заняття та звуження кола інтересів. Усе витісняє необхідність почуватися дуже потрібним, незамінним у певних справах. Трудоголікам ніколи й нецікаво користуватися результатами своєї праці, вони постійно жертвують власними потребами. Багато з них щасливі, коли про них кажуть, що вони «горять на роботі», і заздрять тим, кому вдалося померти на трудовому посту. До трудоголізму більш схильні старші або єдині діти в сім'ї, де батько - алкоголік, а мати - співзалежна. Дитина виконує безліч домашніх обов'язків, намагається добре вчитися, щоб компенсувати ганьбу сім'ї, посилено готується до престижного вишу або домагається спортивних перемог. Вона позбавляє себе відпочинку і розваг, стає антиподом батькові. Але це тільки зовні, основа у трудоголізму й алкоголізму спільна: втеча в залежність, саморуйнування.",
	},
	sections: {
		"1": {
			title: {
				ru: "Тест на трудоголизм",
				ua: "Тест на трудоголізм",
			},
			description: {
				ru: "",
				ua: "",
			},
			questions: {
				"1": {
					text: {
						ru: "Важна ли для вас ваша работа?",
						ua: "Чи важлива для вас ваша робота?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"2": {
					text: {
						ru: "Нравится ли вам делать вещи совершенно безукоризненно?",
						ua: "Чи подобається вам робити речі абсолютно бездоганно?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"3": {
					text: {
						ru: "Свойственно ли вам черно-белое мышление? Все либо хорошо либо плохо.",
						ua: "Чи властиве вам чорно-біле мислення? Все або добре або погано.",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"4": {
					text: {
						ru: "Стремитесь ли вы к конкуренции и важна ли для вас победа в ней?",
						ua: "Чи прагнете ви конкуренції і чи важлива для вас перемога в ній?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"5": {
					text: {
						ru: "Важно ли для вас всегда быть правым?",
						ua: "Чи важливо для вас завжди бути правим?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"6": {
					text: {
						ru: "Критичны ли вы к себе, осуждаете ли себя в случае совершения ошибки?",
						ua: "Чи критичні ви до себе, чи засуджуєте себе в разі здійснення помилки?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"7": {
					text: {
						ru: "Боитесь ли вы все время поражения?",
						ua: "Чи боїтеся ви весь час поразки?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"8": {
					text: {
						ru: "Беспокойны ли вы, импульсивны ли вы?",
						ua: "Чи неспокійні ви, чи імпульсивні ви?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"9": {
					text: {
						ru: "Часто ли вам становится скучно?",
						ua: "Чи часто вам стає нудно?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"10": {
					text: {
						ru: "Загоняете ли вы себя до истощения?",
						ua: "Чи заганяєте ви себе до виснаження?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"11": {
					text: {
						ru: "Возникают ли у вас периодически состояния, во время которых вы чувствуете себя чрезвычайно усталым?",
						ua: "Чи виникають у вас періодично стани, під час яких ви почуваєтеся надзвичайно втомленим?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"12": {
					text: {
						ru: "Испытываете ли вы чувство вины при появлении у вас дискомфорта?",
						ua: "Чи відчуваєте ви почуття провини при появі у вас дискомфорту?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"13": {
					text: {
						ru: "Считаете ли вы себя необычным или отличающимся от других?",
						ua: "Чи вважаєте ви себе незвичайним або таким, що відрізняється від інших?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"14": {
					text: {
						ru: "Читаете ли вы постоянно материалы, связанные с работой, даже во время еды или просмотра телевизора?",
						ua: "Чи читаєте ви постійно матеріали, пов'язані з роботою, навіть під час їжі або перегляду телевізора?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"15": {
					text: {
						ru: "Составляете ли вы список того, что необходимо сделать, или ведете дневник?",
						ua: "Чи складаєте ви список того, що необхідно зробити, або ведете щоденник?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"16": {
					text: {
						ru: "Обнаруживаете ли вы, что вам становится все труднее и труднее проводить свободное время в выходные, каникулы и во время отпуска?",
						ua: "Чи виявляєте ви, що вам стає дедалі важче і важче проводити вільний час у вихідні, канікули та під час відпустки?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"17": {
					text: {
						ru: "Часто ли вы чувствуете, что вам не хватает времени и вы хотите, чтобы сутки продолжались больше 24 часов?",
						ua: "Чи часто ви відчуваєте, що вам не вистачає часу і ви хочете, щоб доба тривала більше 24 годин?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"18": {
					text: {
						ru: "Поддерживаете ли вы деловую связь с коллегами во время отдыха?",
						ua: "Чи підтримуєте ви діловий зв'язок із колегами під час відпочинку?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"19": {
					text: {
						ru: "Относитесь ли вы к работе как к игре и выходите из себя, если играете плохо?",
						ua: "Чи ставитеся ви до роботи як до гри і чи виходите з себе, якщо граєте погано?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"20": {
					text: {
						ru: "Избегаете ли вы думать о том, что вы будете делать, когда не будете работать?",
						ua: "Чи уникаєте ви думати про те, що ви робитимете, коли не працюватимете?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"21": {
					text: {
						ru: "Вы ответственны на работе, но безответственны в личных делах.",
						ua: "Ви відповідальні на роботі, але безвідповідальні в особистих справах.",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"22": {
					text: {
						ru: "Стараетесь ли вы избежать конфликта вместо того, чтобы его разрешить?",
						ua: "Чи намагаєтеся ви уникнути конфлікту замість того, щоб його вирішити?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"23": {
					text: {
						ru: "Характерны ли для вас импульсивные действия, когда вы не обращаете внимание на то, как они повлияют на других людей?",
						ua: "Чи характерні для вас імпульсивні дії, коли ви не звертаєте увагу на те, як вони вплинуть на інших людей?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"24": {
					text: {
						ru: "Вы боитесь критики, но сами любите осуждать и критиковать.",
						ua: "Ви боїтеся критики, але самі любите засуджувати і критикувати.",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"25": {
					text: {
						ru: "Вы заметили, что у вас ухудшилась память на то, о чем вам говорили другие.",
						ua: "Ви помітили, що у вас погіршилася пам'ять на те, про що вам говорили інші.",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"26": {
					text: {
						ru: "Выходите ли вы из себя, если все идет не так, как вы запланировали?",
						ua: "Чи виходите ви з себе, якщо все йде не так, як ви запланували?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"27": {
					text: {
						ru: "Если вас прерывают во время решения вами производственных проблем в домашних условиях, вызывает ли это у вас резкое раздражение?",
						ua: "Якщо вас переривають під час вирішення вами виробничих проблем у домашніх умовах, чи викликає це у вас різке роздратування?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"28": {
					text: {
						ru: "Создаете ли вы безвыходные ситуации для себя и для других?",
						ua: "Чи створюєте ви безвихідні ситуації для себе і для інших?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"29": {
					text: {
						ru: "Сконцентрированы ли вы на событиях будущего, вместо того чтобы радоваться настоящему?",
						ua: "Чи сконцентровані ви на подіях майбутнього, замість того щоб радіти сьогоденню?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
				"30": {
					text: {
						ru: "Забываете ли вы и преуменьшаете ли значение семейных событий и праздников?",
						ua: "Забуваєте ви і применшуєте значення сімейних подій і свят?",
					},
					answers: {
						"1": {
							text: {
								ru: "Да",
								ua: "Так",
							},
							points: 1,
						},
						"2": {
							text: {
								ru: "Нет",
								ua: "Ні",
							},
							points: 0,
						},
					},
				},
			},
		},
	},
	ratings: [
		{
			requiredPoints: 0,
			result: {
				ru: "Здоровый трудоголизм",
				ua: "Здоровий трудоголізм",
			},
			characteristics: {
				ru: [
					"Увлечение и энтузиазм в работе",
					"Желание проявлять себя, которое наполняет, а не забирает ресурс",
					"Реалистичные требования к результатам работы",
					"Здоровая реакция на неудачи в работе",
				],
				ua: [
					"Захоплення та ентузіазм у роботі",
					"Бажання проявляти себе, яке наповнює, а не забирає ресурс",
					"Реалістичні вимоги до результатів роботи",
					"Здорова реакція на невдачі в роботі",
				],
			},
		},
		{
			requiredPoints: 20,
			result: {
				ru: "Не здоровый трудоголизм",
				ua: "Нездоровий трудоголізм",
			},
			characteristics: {
				ru: [
					"Работа как единственный источник высокой самооценки",
					"Завышенный перфекционизм",
					"Нетерпимость к неудачным результатам",
					"Отсутствие других занятий кроме карьеры",
				],
				ua: [
					"Робота як єдине джерело високої самооцінки",
					"Завищений перфекціонізм",
					"Нетерпимість до невдалих результатів",
					"Відсутність інших занять крім кар'єри",
				],
			},
		},
	],
	maxPoints: 30,
};

const sectionInfo = Object.values(quiz.sections);

const section = sectionInfo.map((item) => item.questions);

export const questions = section.map((item) => item && Object.values(item).map((item) => item.text));

export const allAnswersWithPoints = section.map(
	(item) =>
		item &&
		Object.values(item).map((questionItem) => ({
			answer: questionItem?.text,
			points: questionItem?.answers,
		}))
);

const numArray = [];

for (let i = 0; i < sectionInfo.length; i++) {
	numArray.push(i);
}

export const sectionsArray = numArray;

export const answerAndPoints = allAnswersWithPoints[0].map((item) => {
	return {
		answer: item.answer,
		points: Object.keys(item.points).map((point) => {
			const pointValue = point as keyof typeof item.points;
			return item.points[pointValue];
		}),
	};
});
